thmalmeida/STM32F10y/src/acionna.h
		dayLog_OFF[i] = dayLog_OFF[i-1];
		monthLog_OFF[i] = monthLog_OFF[i-1];
	}

	reasonV[1] = reasonV[0];
	reasonV[0] = reason;

	hourLog_OFF[0] = tm.Hour;
	minuteLog_OFF[0] = tm.Minute;

	dayLog_OFF[0] = tm.Day;
	monthLog_OFF[0] = tm.Month;

	timeOff_min = 0;
	timeOff_sec = 0;

	flag_waitPowerOn = 1;
	waitPowerOn_min = waitPowerOn_min_standBy;

	driveMotor_OFF();
	drive_led_off();
	_delay_ms(1);

	motorStatus = readPin_k1_PIN();
}
void ACIONNA::motor_start()
{
	if(!flag_waitPowerOn)
	{
		int i;
		for(i=(nLog-1);i>0;i--)
		{
			hourLog_ON[i] = hourLog_ON[i-1];
			minuteLog_ON[i] = minuteLog_ON[i-1];

			dayLog_ON[i] = dayLog_ON[i-1];
			monthLog_ON[i] = monthLog_ON[i-1];
		}

		hourLog_ON[0] = tm.Hour;
		minuteLog_ON[0] = tm.Minute;

		dayLog_ON[0] = tm.Day;
		monthLog_ON[0] = tm.Month;

		timeOn_min = 0;
		timeOn_sec = 0;

		PRessHold = PRess;

		driveMotor_ON(startTypeK);
		drive_led_on();

		_delay_ms(1);

		motorStatus = readPin_k1_PIN();
	}
}
void ACIONNA::driveMotor_ON(uint8_t startType)
{
	switch (startType)
	{
		case 1:	// Partida direta: monofásico
			k1_on();
			break;

		case 2: // Partida direta: trifásico
			k1_on();
			k2_on();
			break;

		case 3:	// Partida estrela/triangulo
			k1_on();
			k3_on();
			//wdt_reset();
			_delay_ms(((double) 100.0*motorTimerStart1));
			//wdt_reset();

			k3_off();
			uint32_t countK = 0;
			while(readPin_k3())
			{
				countK++;
				if(countK>=120000)
				{
					k1_off();
					k2_off();
					k3_off();
					return;
				}
			}
		//			Serial.print("FuCK: ");
		//			Serial.println(count);
			_delay_ms(motorTimerStart2);
			k2_on();
			break;
	}
}
void ACIONNA::get_levelSensors()
{
	// Select ADC0 - LL sensor
	levelSensorLL_d = adc_readChannel(0);

	if(levelSensorLL_d < levelRef_10bit)
		levelSensorLL = 1;
	else
		levelSensorLL = 0;


	// Select ADC1 - ML sensor
	levelSensorML_d = adc_readChannel(1);

	if(levelSensorML_d < levelRef_10bit)
		levelSensorML = 1;
	else
		levelSensorML = 0;


	// Select ADC2 - HL sensor
	levelSensorHL_d = adc_readChannel(2);

	if(levelSensorHL_d < levelRef_10bit)
		levelSensorHL = 1;
	else
		levelSensorHL = 0;
}
double ACIONNA::get_Pressure()
{
	/*
	Sensor details

    Thread size : G 1/4" (BSP)
    Sensor material:  Carbon steel alloy
    Working voltage: 5 VDC
    Output voltage: 0.5 to 4.5 VDC
    Working Current: <= 10 mA
    Working pressure range: 0 to  1.2 MPa
    Maxi pressure: 2.4 MPa
    Working temperature range: 0 to 100 graus C
    Accuracy: ± 1.0%
    Response time: <= 2.0 ms
    Package include: 1 pc pressure sensor
    Wires : Red---Power (+5V)  Black---Power (0V) - blue ---Pulse singal output


    4.5 V___	   922___	1.2 MPa___	 12 Bar___	 120 m.c.a.___
	  	  |				|			|			|				|
	 	  |				|			|			|				|
	 	  |				|			|			|				|
	  out_|			Pd__|		  __|			|			Pa__|
	 	  |				|			|			|				|
	 	  |				|			|			|				|
	 	  |				|			|			|				|
		 _|_		   _|_		   _|_		   _|_			   _|_
	0.5 V			103			0 MPa		0 Bar		0 m.c.a.

	(out-0.5)/(4.5-0.5) = 1024

	(out-0.0)/(5-0) = (x-0)/(1024-0)

	(Pd - 103)/(922-103) = (Pa - 0)/(120 - 0)
	Pa = 120.0*Pd/(1024.0);

	(xs - 0) = temp - (0)
	(255 - 0)  +50 - (0)

	Direct Conversion
	xs = 255*(temp+0)/51
	tempNow_XS = (uint8_t) 255.0*(tempNow+0.0)/51.0;

	Inverse Conversion
	temp = (TempMax*xs/255) - TempMin
	tempNow = (uint8_t) ((sTempMax*tempNow_XS)/255.0 - sTempMin);
    */

	const double Kpsi = 0.7030768118;
//	const double PRessMax = 68.9475729;	// Sensor max pressure [m.c.a.] with 100 psi;
//	const double PRessMax = 103.4212;	// Sensor max pressure [m.c.a.] with 150 psi;
//	const double PRessMax = 120.658253;	// Sensor max pressure [m.c.a.] with 174.045 psi;

	double PRessMax = Kpsi*PRessureMax_Sensor;

	Pd = adc_readChannel(7);
	return (PRessMax)*(Pd-102.4)/(921.6-102.4);
//	(Pd - 103)/(922-103) = (Pa - 0)/(120 - 0);
}
void ACIONNA::check_pressure()
{
	PRess = get_Pressure();	// Get current pressure

//	switch (stateMode)
//	{
//		case 1:
//			break;
//
//		case 2:
//			break;
//
//		case 3:	// Valve mode case. Do not turn off.
//			break;
//
//		default:
//			break;
//	}
}
void ACIONNA::check_levelSensors()
{
	get_levelSensors();
}
void ACIONNA::check_period()
{
	// Season time verify
	if(((tm.Hour == HourOn) && (tm.Minute == MinOn)) || (tm.Hour > HourOn) || (tm.Hour < HourOff) || ((tm.Hour == HourOff) && (tm.Minute < MinOff)))
	{
		periodo = greenTime;

		if(flag_01)
		{
			flag_01 = 0;
//			flag_timeMatch = 1;
		}
	}

	if (((tm.Hour == HourOff) && (tm.Minute >= MinOff))	|| ((tm.Hour > HourOff) && (tm.Hour < HourOn))	|| ((tm.Hour == HourOn) && (tm.Minute < MinOn)))
	{
		periodo = redTime;

//		flag_timeMatch = 0;
		flag_01 = 1;
	}
}
void ACIONNA::check_timeMatch()
{
	uint8_t i, nTM_var=1;

	// matching time verify
	if(!motorStatus)
	{
		if(stateMode)
		{
			switch (stateMode)
			{
			case 1:
				nTM_var = 1;
				break;

			case 2:
				nTM_var = nTM;
				break;

			case 3:
				nTM_var = nTM;
				break;
			}

			for(i=0;i<nTM_var;i++)
			{
				if((tm.Hour == HourOnTM[i]) && (tm.Minute == MinOnTM[i]))
				{
					flag_timeMatch = 1;	// IF conditions are OK, SET (flag_timeMatch) variable;
				}
			}
		}
	}
}
void ACIONNA::check_thermalSafe()
{
	if(motorStatus)
	{
		if(readPin_Rth())
		{
			uint16_t countThermal = 50000;
			Serial.println("Th0");
			while(readPin_Rth() && countThermal)
			{
				countThermal--;
			}
			Serial.println("Th1");
			if(!countThermal)
			{
				flag_Th = 1;
			}
			else
				flag_Th = 0;
		}
		else
		{
			flag_Th = 0;
		}
	}
}
void ACIONNA::check_gpio()
{
	if(startTypeK == 1)
	{
		motorStatus = readPin_k1_PIN();

	}
	else
	{
		motorStatus = readPin_k1();
	}
}
void ACIONNA::check_TimerVar()
{
	if(motorStatus)	// Load is ON;
	{
		if(timeOn_sec > 59)
		{
			timeOn_sec = 0;
			timeOn_min++;
		}
		else
		{
			timeOn_sec++;
		}
	}
	else			// Load is OFF;
	{
		if(timeOff_sec > 59)
		{
			timeOff_sec = 0;
			timeOff_min++;
		}
		else
		{
			timeOff_sec++;
		}
	}

	if(flag_waitPowerOn)
	{
		if(waitPowerOn_sec == 0)
		{
			if(waitPowerOn_min == 0)
			{
				flag_waitPowerOn = 0;
			}
			else
			{
				waitPowerOn_sec = 59;
				waitPowerOn_min--;
			}
		}
		else
		{
			waitPowerOn_sec--;
		}
	}
}
void ACIONNA::check_pressureDown()
{
	if(stateMode == 5)
	{
		if(motorStatus)
		{
			if(PRess > PRessHold)
			{
				PRessHold = PRess;
			}
			else if(PRess < ((PRessurePer/100.0)*PRessHold))
			{
				flag_PressureDown = 1;
			}
		}
	}
}
void ACIONNA::process_valveControl()
{
	if(flag_timeMatch && (PRess >= PRessureRef_Valve))
	{
		flag_timeMatch &= 0;

