thmalmeida/STM32F10y/src/acionna.h
		if(!motorStatus)
		{
			motor_start();
		}
	}
}
void ACIONNA::process_waterPumpControl()
{
	/*
	 * 0x01 - pressure
	 * 0x02 - level
	 * 0x03 - thermal
	 * 0x04 - time out
	 * 0x05 - red time
	 * 0x06 - command line
	 * 0x07 - broke pressure
	 * */

	if(!levelSensorLL)
	{
		if(motorStatus)
		{
			motor_stop(0x02);
		}
	}

	if(levelSensorHL && (stateMode == 4) && levelSensorLL)
	{
		if(!motorStatus)
		{
			motor_start();
		}
	}

	if(flag_timeMatch && (stateMode != 4))
	{
		flag_timeMatch = 0;

		if(!motorStatus)
		{
			motor_start();
		}
	}

	if(PRessureRef)					// Has a valid number mean this function is activated
	{
		if(PRess >= PRessureRef)
		{
			if(motorStatus)
			{
				motor_stop(0x01);
			}
		}
	}

	if(stateMode == 5)
	{
		if(motorStatus && flag_PressureDown)
		{
			flag_PressureDown = 0;
			motor_stop(0x07);
		}
	}

	if(flag_Th)
	{
		motor_stop(0x03);
		stateMode = 0;
		//eeprom_write_byte(( uint8_t *)(addr_stateMode), stateMode);
	}
}
void ACIONNA::process_motorPeriodDecision()
{
	switch (periodo)
	{
	case redTime:
		if(motorStatus)
		{
			motor_stop(0x05);
		}
		break;

	case greenTime:
		process_waterPumpControl();
		break;
	}
}
void ACIONNA::process_Mode()
{
	switch (stateMode)
	{
		case 0:	// System Down!
			break;

		case 1:	// Night Working;
			process_motorPeriodDecision();
			break;

		case 2:	// For irrigation mode. Start in a programmed time.
			process_waterPumpControl();
			break;

		case 3:	// For reservoir only. Works in a inverted pressured! Caution!
			process_valveControl();
			break;

		case 4:	// Is that for a water pump controlled by water sensors. Do not use programmed time.
			process_waterPumpControl();
			break;

		case 5:	// For irrigation mode and instantly low pressure turn motor off.
			process_waterPumpControl();
			break;

		default:
			stateMode = 0;
			Serial.println("Standby");
			break;
	}

	// maximum time drive keeps turned ON
	if(motorTimerE)
	{
		if(motorStatus)
		{
			if(timeOn_min >= motorTimerE)
			{
				motor_stop(0x04);
			}
		}
	}
}
void ACIONNA::summary_Print(uint8_t opt)
{
	switch (opt)
	{
		case 0:
			sprintf(buffer,"Time:%.2d:%.2d:%.2d %.2d/%.2d/%.4d",tm.Hour, tm.Minute, tm.Second, tm.Day, tm.Month, tm.Year+1970);
			Serial.print(buffer);

//			sprintf(buffer," UP:%.2d:%.2d:%.2d, d:%d m:%d", hour(), minute(), second(), day()-1, month()-1);
			sprintf(buffer," UP:%.2d:%.2d:%.2d, d:%d m:%d", rtc.rtc0->tm_hour, rtc.rtc0->tm_min, rtc.rtc0->tm_sec, rtc.rtc0->tm_mday-1, rtc.rtc0->tm_mon);
			Serial.println(buffer);

			sprintf(buffer," P:%d k1:%d",periodo, motorStatus);
			Serial.println(buffer);

			switch (stateMode)
			{
				case 0:
					strcpy(buffer," Modo:Desligado");
					break;

				case 1:
					sprintf(buffer," Modo:Liga Noite");
					break;

				case 2:
					if(nTM == 1)
					{
						sprintf(buffer," Irrig: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(buffer," Irrig: Liga %dx/dia",nTM);
					}
					break;

				case 3:
					if(nTM == 1)
					{
						sprintf(buffer," Valve: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(buffer," Valve: Liga %dx/dia",nTM);
					}
					break;

				case 4:
					sprintf(buffer," Modo: Auto HL");
					break;

				case 5:
					if(nTM == 1)
					{
						sprintf(buffer," IrrigLow: Liga %dx as %2.d:%.2d", nTM, HourOnTM[0], MinOnTM[0]);
					}
					else
					{
						sprintf(buffer," IrrigLow: Liga %dx/dia",nTM);
					}
					break;
					break;


				default:
					strcpy(buffer,"sMode Err");
					break;
			}
			Serial.println(buffer);
			break;

		case 1:
			int i;
			if(motorStatus)
			{
				for(i=(nLog-1);i>=0;i--)
				{
					memset(buffer,0,sizeof(buffer));
					sprintf(buffer,"OFF_%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_OFF[i], minuteLog_OFF[i], dayLog_OFF[i], monthLog_OFF[i]);
					Serial.println(buffer);
					_delay_ms(20);

					memset(buffer,0,sizeof(buffer));
					sprintf(buffer,"ON__%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_ON[i], minuteLog_ON[i], dayLog_ON[i], monthLog_ON[i]);
					Serial.println(buffer);
					_delay_ms(20);
				}
			}
			else
			{
				for(i=(nLog-1);i>=0;i--) //	for(i=0;i<nLog;i++)
				{
					memset(buffer,0,sizeof(buffer));
					sprintf(buffer,"ON__%.2d: %.2d:%.2d, %.2d/%.2d " ,(i+1),hourLog_ON[i], minuteLog_ON[i], dayLog_ON[i], monthLog_ON[i]);
					Serial.println(buffer);
					_delay_ms(20);

					memset(buffer,0,sizeof(buffer));
					sprintf(buffer,"OFF_%.2d: %.2d:%.2d, %.2d/%.2d ",(i+1),hourLog_OFF[i], minuteLog_OFF[i], dayLog_OFF[i], monthLog_OFF[i]);
					Serial.println(buffer);
					_delay_ms(20);
				}
			}
			sprintf(buffer,"r0:%d, r1:%d ",reasonV[0], reasonV[1]);
			Serial.println(buffer);
			break;

		case 2:
			sprintf(buffer,"f:%d t1:%.2d:%.2d c%dmin t2:%.2d:%.2d s:%dmin ", flag_waitPowerOn, waitPowerOn_min, waitPowerOn_sec, waitPowerOn_min_standBy, timeOn_min, timeOn_sec, motorTimerE);
			Serial.println(buffer);
			break;

		case 3:
			sprintf(buffer,"Motor:%d Fth:%d Rth:%d Pr:%d ", motorStatus, flag_Th, readPin_Rth(), PRess);
			Serial.print(buffer);
			switch (stateMode)
			{
				case 3:
					sprintf(buffer,"Pref:%d ", PRessureRef_Valve);
					Serial.println(buffer);
					break;

				case 5:
					sprintf(buffer,"Pref:%d, Pper:%d ", PRessureRef, PRessurePer);
					Serial.println(buffer);
					break;

				default:
					sprintf(buffer,"Pref:%d ", PRessureRef);
					Serial.println(buffer);
					break;

			}
			break;

		case 4:
			sprintf(buffer,"LL:%d ML:%d HL:%d ",levelSensorLL, levelSensorML, levelSensorHL);
			Serial.println(buffer);

			sprintf(buffer,"LL:%d ML:%d HL:%d",levelSensorLL_d, levelSensorML_d, levelSensorHL_d);
			Serial.println(buffer);
			break;

		case 5:
			for(i=0;i<nTM;i++)
			{
				sprintf(buffer,"h%d: %.2d:%.2d",i+1, HourOnTM[i], MinOnTM[i]);
				Serial.println(buffer);
			}
			break;

