thmalmeida/STM32F10y/src/acionna.h
		case 6:
			sprintf(buffer,"tON:%.2d:%.2d ",timeOn_min, timeOn_sec);
			Serial.println(buffer);
			sprintf(buffer,"tOFF:%.2d:%.2d",timeOff_min, timeOff_sec);
			Serial.println(buffer);
			break;

		case 7:
			sprintf(buffer,"P:%d Fth:%d Rth:%d Ftm:%d k1:%d k3:%d", PRess, flag_Th, readPin_Rth(), flag_timeMatch, motorStatus, readPin_k3());
			Serial.println(buffer);

			sprintf(buffer,"LL:%d ML:%d HL:%d  ",levelSensorLL, levelSensorML, levelSensorHL);
			Serial.println(buffer);

			sprintf(buffer,"LL:%d ML:%d HL:%d  ",levelSensorLL_d, levelSensorML_d, levelSensorHL_d);
			Serial.println(buffer);
			break;

		case 8:
//			sprintf(buffer,"WDRF:%d BORF:%d EXTRF:%d PORF:%d", flag_WDRF, flag_BORF, flag_EXTRF, flag_PORF);
//			Serial.println(buffer);
			break;

		case 9:
			sprintf(buffer,"Err");
			Serial.println(buffer);
			break;

		default:
			sprintf(buffer,"not implemented");
			Serial.println(buffer);
			break;
	}
}
void ACIONNA::RTC_update1()
{
	rtc.getUptime();
	rtc.getTime();
	tm.Year 	= rtc.timeinfo->tm_year;
	tm.Month 	= rtc.timeinfo->tm_mon+1;
	tm.Day 		= rtc.timeinfo->tm_mday;
	tm.Hour 	= rtc.timeinfo->tm_hour;
	tm.Minute 	= rtc.timeinfo->tm_min;
	tm.Second 	= rtc.timeinfo->tm_sec;
}
void ACIONNA::RTC_update()
{
	if(tm.Second == 59)
	{
		tm.Second = 0;
		if(tm.Minute == 59)
		{
			tm.Minute = 0;
			if(tm.Hour == 23)
			{
				tm.Hour = 0;
				uint8_t month31, month30;
				if((tm.Month == 1) || (tm.Month == 3) || (tm.Month == 5) || (tm.Month == 7) || (tm.Month == 8) || (tm.Month == 10) || (tm.Month == 12))
				{
					month31 = 1;
				}
				else
				{
					month30 = 1;
				}

				if((tm.Day == 30 && month30) || (tm.Day == 31 && month31))
				{
					tm.Day = 1;
					if(tm.Month == 12)
					{
						tm.Month = 1;
						tm.Year++;
					}
					else
					{
						tm.Month++;
					}
				}
				else
				{
					tm.Day++;
				}
			}
			else
			{
				tm.Hour++;
			}
		}
		else
		{
			tm.Minute++;
		}
	}
	else
	{
		tm.Second++;
	}
}
void ACIONNA::refreshVariables()
{
	if (flag_1s)
	{
		flag_1s = 0;
		RTC_update1();
//		RTC.read(tm);

		check_gpio();			// Check drive status pin;
		check_period();			// Period verify;
		check_timeMatch();		// time matches flag;
//		check_TimerVar();		// drive timers

//		check_pressure();		// get and check pressure system;
//		check_thermalSafe();	// thermal relay check;
//		check_levelSensors();	// level sensors;

//		check_pressureDown();

		if(flag_debug)
		{
			summary_Print(7);
		}
	}
}
void ACIONNA::refreshStoredData()
{
//	stateMode = eeprom.read(eeprom.addr_stateMode);	//eeprom_read_byte((uint8_t *)(addr_stateMode));
//
////	waitPowerOn_min_standBy = //eeprom_read_byte((uint8_t *)(addr_standBy_min));
////	waitPowerOn_min = waitPowerOn_min_standBy;
////
////	uint8_t lbyte, hbyte;
//////	hbyte = eeprom_read_byte((uint8_t *)(addr_LevelRef+1));
//////	lbyte = eeprom_read_byte((uint8_t *)(addr_LevelRef));
////	levelRef_10bit = ((hbyte << 8) | lbyte);
////
//////	hbyte = eeprom_read_byte((uint8_t *)(addr_motorTimerE+1));
//////	lbyte = eeprom_read_byte((uint8_t *)(addr_motorTimerE));
////	motorTimerE = ((hbyte << 8) | lbyte);
//
////	PRessureRef = //eeprom_read_byte((uint8_t *)(addr_PRessureRef));
////	PRessureRef_Valve = //eeprom_read_byte((uint8_t *)(addr_PRessureRef_Valve));
////	PRessurePer = //eeprom_read_byte((uint8_t *)(addr_PREssurePer));
////	PRessureMax_Sensor = //eeprom_read_byte((uint8_t *)(addr_PRessureMax_Sensor));
////
//	nTM = eeprom.read(eeprom.addr_nTM); //eeprom_read_byte((uint8_t *)(addr_nTM));
//
//	int i;
//	for(i=0;i<9;i++)
//	{
//		HourOnTM[i] = eeprom.read(eeprom.addr_HourOnTM+i); //eeprom_read_byte((uint8_t *)(addr_HourOnTM+i));
//		MinOnTM[i] = eeprom.read(eeprom.addr_MinOnTM+i);//eeprom_read_byte((uint8_t *)(addr_MinOnTM+i));
//	}

}
void ACIONNA::handleMessage()
{
/*
$0X;				Verificar detalhes - Detalhes simples (tempo).
	$00;			- Detalhes simples (tempo).
	$01;			- Verifica histórico de quando ligou e desligou;
	$02;			- Mostra tempo que falta para ligar;
		$02:c;		- Zera o tempo;
		$02:c:30;	- Ajusta novo tempo para 30 min;
		$02:s:090;	- Tempo máximo ligado para 90 min. Para não utilizar, colocar zero;
	$03;			- Verifica detalhes do motor, pressão e sensor termico;
		$03:s:72;	- Set pressure ref [m.c.a.];
		$03:v:32;	- Set pressure for valve load turn on and fill reservoir;
		$03:p:150;	- Set sensor max pressure ref to change the scale [psi];
		$03:b:85;	- Set to 85% the pressure min bellow the current pressure to avoid pipe broken;
	$04;			- Verifica detalhes do nível de água no poço e referência 10 bits;
		$04:0;		- Interrompe o envio continuo das variáveis de pressão e nível;
		$04:1;		- Envia continuamente valores de pressão e nível;
		$04:0900;	- Adiciona nova referência para os sensores de nível. Valor de 0 a 1023;
	$05;			- Mostra os horários que liga no modo $62;
	$06;			- Tempo ligado e tempo desligado;
	$07:x;			- ADC reference change.
		$07:0;		- AREF
		$07:1;		- AVCC with external cap at AREF pin
		$07:2;		- Internal 1.1 Voltage reference.
	$08;			- Motivo do reboot.
	$09;			- Reinicia o sistema.

$1:h:HHMMSS;		- Ajustes do calendário;
	$1:h:HHMMSS;	- Ajusta o horário do sistema;
	$1:h:123040;	- E.g. ajusta a hora para 12:30:40
	$1:d:DDMMAAAA;	- Ajusta a data do sistema no formato dia/mês/ano(4 dígitos);
	$1:d:04091986;	- E.g. Altera a data para 04/09/1986;

$2:DevName;			- Change bluetooth name;
	$2:Vassalo;		- Altera o nome do bluetooth para "Vassalo";

$4:x:				- Is this applied fo stm32f10xxx series only;
	$4:r:07;		- Read address 0x07 * 2 of currently page;
	$4:w:07:03;		- Write variable 3 on address 7 of currently page;
	$4:f:64:03;		- fill page 64 with 3 value;
	$4:e:64;		- erase page 64;

$3X;				- Acionamento do motor;
	$31;			- liga o motor;
	$30;			- desliga o motor;

$5:n:X; ou $5:hX:HHMM;
	$5:n:9;			- Configura para acionar 9 vezes. Necessário configurar 9 horários;
	$5:n:9;			- Configura o sistema para acionar uma única vez às 21:30 horas;
	$5:h1:2130;		- Configura o primeiro horário como 21:30 horas;
	$5:h8:0437;		- Configura o oitavo horário como 04:37 horas;

$6X;				- Modos de funcionamento;
	$60; 			- Sistema Desligado (nunca ligará);
	$61;			- Liga somente à noite. Sensor superior;
	$62;			- Liga nos determinados horários estipulados;
	$63;			- Função para válvula do reservatório;
	$64;			- Função para motobomba do reservatório;
*/
	// Tx - Transmitter
	if(enableDecode)
	{
		enableDecode = 0;

//		int i;
//		for(i=0;i<rLength;i++)
//		{
//			Serial1.println(sInstr[i]);
//		}
//		for(i=0;i<rLength;i++)
//		{
//			Serial1.println(sInstr[i],HEX);
//		}

		// Getting the opcode
		aux[0] = '0';
		aux[1] = sInstr[0];
		aux[2] = '\0';
		opcode = (uint8_t) atoi(aux);
//		Serial1.println("Got!");
		uint8_t statusCommand = 0;

