thmalmeida/STM32F10y/src/acionna.h
		switch (opcode)
		{
// -----------------------------------------------------------------
			case 0:		// Check status
			{
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				statusCommand = (uint8_t) atoi(aux);

				switch (statusCommand)
				{
					// ----------
					// $02:c;  -> clear time counter;
					// $02:c:mm;  -> set time counter ref;
					case 2:
					{
						if(sInstr[2]==':' && sInstr[3]=='c')
						{
							if(sInstr[4] == ';')
							{
								flag_waitPowerOn = 0;
								waitPowerOn_min = 0;
								waitPowerOn_sec = 0;
							}
							else if(sInstr[4] ==':' && sInstr[7] == ';')
							{
								aux[0] = sInstr[5];
								aux[1] = sInstr[6];
								aux[2] = '\0';
								waitPowerOn_min_standBy = (uint8_t) atoi(aux);

								//eeprom_write_byte((uint8_t *)(addr_standBy_min), waitPowerOn_min_standBy);

//								Serial.print("powerOn min:");
//								Serial.println(powerOn_min_Standy);
							}
						}//$02:s:129;
						else if(sInstr[2] == ':' && sInstr[3] == 's' && sInstr[4] == ':' && sInstr[8] == ';')
						{
							aux2[0] = '0';
							aux2[1] = sInstr[5];
							aux2[2] = sInstr[6];
							aux2[3] = sInstr[7];
							aux2[4] = '\0';
							motorTimerE = (uint16_t) atoi(aux2);

							uint8_t lbyteRef = 0, hbyteRef = 0;
							lbyteRef = motorTimerE;
							hbyteRef = (motorTimerE >> 8);

							//eeprom_write_byte((uint8_t *)(addr_motorTimerE+1), hbyteRef);
							//eeprom_write_byte((uint8_t *)(addr_motorTimerE), lbyteRef);
						}
						summary_Print(statusCommand);
					}
					break;
					// ------------------------------
					case 3:// $03:s:68;
						if(sInstr[2]==':' && sInstr[3] == 's' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessureRef = (uint8_t) atoi(aux);
							//eeprom_write_byte((uint8_t *)(addr_PRessureRef), PRessureRef);

							sprintf(buffer,"PRessRef: %d", PRessureRef);
							Serial.println(buffer);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'v' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessureRef_Valve = (uint8_t) atoi(aux);
							//eeprom_write_byte((uint8_t *)(addr_PRessureRef_Valve), PRessureRef_Valve);

							sprintf(buffer,"PRessRef_Valve: %d", PRessureRef_Valve);
							Serial.println(buffer);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'p' && sInstr[4] == ':' && sInstr[8] == ';')
						{// $03:p:150;
							aux2[0] = '0';
							aux2[1] = sInstr[5];
							aux2[2] = sInstr[6];
							aux2[3] = sInstr[7];
							aux2[4] = '\0';
							PRessureMax_Sensor = (uint8_t) atoi(aux2);

							//eeprom_write_byte((uint8_t *)(addr_PRessureMax_Sensor), PRessureMax_Sensor);
						}
						else if(sInstr[2]==':' && sInstr[3] == 'b' && sInstr[4] == ':' && sInstr[7] == ';')
						{
							aux[0] = sInstr[5];
							aux[1] = sInstr[6];
							aux[2] = '\0';
							PRessurePer = (uint8_t) atoi(aux);
							//eeprom_write_byte((uint8_t *)(addr_PREssurePer), PRessurePer);
						}
						else
							summary_Print(statusCommand);
						break;
					// ------------------------------
					case 4: // $04:1;
						if(sInstr[2]==':' && sInstr[4]==';')
						{
							aux[0] = '0';
							aux[1] = sInstr[3];
							aux[2] = '\0';
							uint8_t debugCommand;
							debugCommand = (uint8_t) atoi(aux);
							flag_debug = debugCommand;
						}//$04:s:0900;
						else if(sInstr[2]==':' && sInstr[3]=='s' && sInstr[4]==':' && sInstr[9]==';')
						{
							aux2[0] = sInstr[5];
							aux2[1] = sInstr[6];
							aux2[2] = sInstr[7];
							aux2[3] = sInstr[8];
							aux2[4] = '\0';

							levelRef_10bit = (uint16_t) atoi(aux2);

							uint8_t lbyteRef = 0, hbyteRef = 0;
							lbyteRef = levelRef_10bit;
							hbyteRef = (levelRef_10bit >> 8);

							//eeprom_write_byte((uint8_t *)(addr_LevelRef+1), hbyteRef);
							//eeprom_write_byte((uint8_t *)(addr_LevelRef), lbyteRef);
						}
						summary_Print(statusCommand);
						sprintf(buffer,"Ref: %d", levelRef_10bit);
						Serial.println(buffer);
						break;
					// ------------------------------
					case 7:
						if(sInstr[2]==':' && sInstr[4]==';')
						{
							aux[0] = '0';
							aux[1] = sInstr[3];
							aux[2] = '\0';
							uint8_t adcCommand = (uint8_t) atoi(aux);

							switch (adcCommand)
							{
//								case 0:
//									ADMUX &=  ~(1<<REFS1);		// AREF, Internal Vref turned off
//									ADMUX &=  ~(1<<REFS0);
//									Serial.println("AREF");
//									break;
//
//								case 1:
//									ADMUX &=  ~(1<<REFS1);		// AVCC with external capacitor at AREF pin
//									ADMUX |=   (1<<REFS0);
//									Serial.println("AVCC");
//									break;
//
//								case 2:
//									ADMUX |=   (1<<REFS1);		// Internal 1.1V Voltage Reference with external capacitor at AREF pin
//									ADMUX |=   (1<<REFS0);
//									Serial.println("1.1V");
//									break;
							}
						}
						break;
					// ------------------------------
					case 9:
						Serial.println("Rebooting...");
						//wdt_enable(WDTO_15MS);
						_delay_ms(100);
//						flag_reset = 1;
						break;

					default:
						summary_Print(statusCommand);
						break;
				}
			}
			break;
// -----------------------------------------------------------------
			case 1: // Setup calendar
			{
				// Set-up clock -> $1:h:HHMMSS;
				if(sInstr[1]==':' && sInstr[2]=='h' && sInstr[3]==':' && sInstr[10]==';')
				{
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					tm.Hour = (uint8_t) atoi(aux);

					aux[0] = sInstr[6];
					aux[1] = sInstr[7];
					aux[2] = '\0';
					tm.Minute = (uint8_t) atoi(aux);

					aux[0] = sInstr[8];
					aux[1] = sInstr[9];
					aux[2] = '\0';
					tm.Second = (uint8_t) atoi(aux);

//					RTC.write(tm);
					rtc.write(tm);
					summary_Print(0);
				}
				// 	Set-up date -> $1:d:DDMMAAAA;
				else if(sInstr[1]==':' && sInstr[2]=='d' && sInstr[3]==':' && sInstr[12]==';')
				{
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					tm.Day = (uint8_t) atoi(aux);

					aux[0] = sInstr[6];
					aux[1] = sInstr[7];
					aux[2] = '\0';
					tm.Month = (uint8_t) atoi(aux);

