thmalmeida/STM32F10y/src/acionna.h
					char aux2[5];
					aux2[0] = sInstr[8];
					aux2[1] = sInstr[9];
					aux2[2] = sInstr[10];
					aux2[3] = sInstr[11];
					aux2[4] = '\0';
					tm.Year = (uint8_t) (atoi(aux2)-1970);

//					RTC.write(tm);
					rtc.write(tm);

					summary_Print(0);

				}
			}
			break;
// -----------------------------------------------------------------
			case 2:		// Setup Bluetooth device name
			{
				// Setup clock -> $2:BluetoothName;
				char aux_str[sInstr_SIZE], aux_str2[sInstr_SIZE+7];
				uint8_t k1=0;
				if(sInstr[1]==':')
				{
					// 3 because 2 and : count 2 characters and one more for '\0'
					while((k1<sInstr_SIZE-3) && sInstr[k1] != ';')
					{
						aux_str[k1] = sInstr[k1+2];
						k1++;
//						Serial.println(k1);
					}

					aux_str[k1-2] = '\0';
					Serial.println("Disconnect!");
//					wdt_reset();
//					_delay_ms(3000);
//					wdt_reset();
//					_delay_ms(3000);
//					wdt_reset();
//					_delay_ms(3000);
//					strcpy(aux_str2,"AT");
//					Serial.print(aux_str2);
					//wdt_reset();
					_delay_ms(3000);
					strcpy(aux_str2,"AT+NAME");
					strcat(aux_str2,aux_str);
					Serial.print(aux_str2);
					//wdt_reset();
					_delay_ms(1000);
				}
			}
			break;
// -----------------------------------------------------------------
			case 3:		// Set motor ON/OFF
			{
				uint8_t motorCommand;
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				motorCommand = (uint8_t) atoi(aux);

				if (motorCommand && (!motorStatus))
				{
					motor_start();
				}
				else
				{
					motor_stop(0x06);
				}

				summary_Print(3);
			}
			break;
// -----------------------------------------------------------------
			case 4: 	// FLASH store test, //$4:r:23; and $4:w:23:03;
			{
				if(sInstr[1]==':' && sInstr[2]=='r' && sInstr[3]==':' && sInstr[6]==';')
				{	// $4:r:05; read 05*2 address of page block
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t addrt = (uint8_t) atoi(aux);
					uint8_t var = eeprom.read(eeprom.pageSet, addrt);
					sprintf(buffer,"EE read: %d ", var);
					Serial.println(buffer);

					sprintf(buffer,"Page %d ", eeprom.pageSet);
					Serial.println(buffer);

					sprintf(buffer,"Address %X ", eeprom.pageAddress(eeprom.pageSet));
					Serial.println(buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='w' && sInstr[3]==':' && sInstr[6]==':' && sInstr[9]==';')
				{	// $4:w:03:07;
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t addrt = (uint8_t) atoi(aux);

					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					uint8_t var = (uint8_t) atoi(aux);

					eeprom.write(eeprom.pageSet, addrt, var);
					sprintf(buffer,"EE write: %d ", var);
					Serial.println(buffer);

					var = eeprom.read(eeprom.pageSet, addrt);
					sprintf(buffer,"EE read2: %d ", var);
					Serial.println(buffer);

					sprintf(buffer,"Page %d ", eeprom.pageSet);
					Serial.println(buffer);

					sprintf(buffer,"Address %X ", eeprom.pageAddress(eeprom.pageSet));
					Serial.println(buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='f' && sInstr[3]==':' && sInstr[6]==':' && sInstr[9]==';')
				{	// $4:f:64:07;	fill page 64 with 07 value;
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t page = (uint8_t) atoi(aux);

					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					uint8_t var = (uint8_t) atoi(aux);



					eeprom.writePage(page, (var << 8 | var));
					sprintf(buffer,"Filled page %d ", page);
					Serial.println(buffer);

					sprintf(buffer,"Address %X ", eeprom.pageAddress(page));
					Serial.println(buffer);
				}
				if(sInstr[1]==':' && sInstr[2]=='e' && sInstr[3]==':' && sInstr[6]==';')
				{	// $4:e:64;	erase page 64
					// Getting the parameters
					aux[0] = sInstr[4];
					aux[1] = sInstr[5];
					aux[2] = '\0';
					uint8_t page = (uint8_t) atoi(aux);

					eeprom.erasePage(page);
					sprintf(buffer,":Page %d erased!", page);
					Serial.println(buffer);

					sprintf(buffer,"Address %X ", eeprom.pageAddress(page));
					Serial.println(buffer);
				}
				break;
			}
// -----------------------------------------------------------------
			case 5: // Command is $5:h1:2130;
			{
				if(sInstr[1]==':' && sInstr[2]=='h' && sInstr[4]==':' && sInstr[9]==';')
				{
					aux[0] = '0';
					aux[1] = sInstr[3];
					aux[2] = '\0';
					uint8_t indexV = (uint8_t) atoi(aux);

					aux[0] = sInstr[5];
					aux[1] = sInstr[6];
					aux[2] = '\0';
					HourOnTM[indexV-1] = (uint8_t) atoi(aux);
//					eeprom.write(eeprom.addr_HourOnTM+indexV-1, HourOnTM[indexV-1]);
					//eeprom_write_byte(( uint8_t *)(addr_HourOnTM+indexV-1), HourOnTM[indexV-1]);

					aux[0] = sInstr[7];
					aux[1] = sInstr[8];
					aux[2] = '\0';
					MinOnTM[indexV-1] = (uint8_t) atoi(aux);
//					eeprom.write(eeprom.addr_MinOnTM+indexV-1, MinOnTM[indexV-1]);
//					eeprom_write_byte(( uint8_t *)(addr_MinOnTM+indexV-1), MinOnTM[indexV-1]);

					summary_Print(5);
				}
				else if(sInstr[1]==':' && sInstr[2]=='n' && sInstr[3]==':' && sInstr[5]==';')
				{
					aux[0] = '0';
					aux[1] = sInstr[4];
					aux[2] = '\0';

					nTM = (uint8_t) atoi(aux);
//					eeprom.write(eeprom.addr_nTM, nTM);
					//eeprom_write_byte(( uint8_t *)(addr_nTM), nTM);

					summary_Print(5);
				}
				else if(sInstr[1]==';')
				{
					summary_Print(5);
				}
			}
			break;
// ----------------------------------------------------------------
			case 6:		// Set working mode
			{
				aux[0] = '0';
				aux[1] = sInstr[1];
				aux[2] = '\0';
				stateMode = (uint8_t) atoi(aux);
//				eeprom.write(eeprom.addr_stateMode, stateMode);
//				//eeprom_write_byte(( uint8_t *)(addr_stateMode), stateMode);

				summary_Print(0);
			}
			break;
// -----------------------------------------------------------------
			default:
				summary_Print(10);
				break;
		}
		memset(sInstr,0,sizeof(sInstr));	// Clear all vector;
	}
}
void ACIONNA::comm_Bluetooth()
{
	// Rx - Always listening
//	uint8_t j2 =0;
	while((Serial.available()>0))	// Reading from serial
	{
		inChar = Serial.read();

		if(inChar=='$')
		{
			j2 = 0;
			flag_frameStartBT = 1;
//			Serial.println("Frame Start!");
		}

		if(flag_frameStartBT)
			sInstrBluetooth[j2] = inChar;

//		sprintf(buffer,"J= %d",j2);
//		Serial.println(buffer);

		j2++;

		if(j2>=sizeof(sInstrBluetooth))
		{
			memset(sInstrBluetooth,0,sizeof(sInstrBluetooth));
			j2=0;
//			Serial.println("ZEROU! sIntr BLuetooth Buffer!");
		}

		if(inChar==';')
		{
//			Serial.println("Encontrou ; !");
			if(flag_frameStartBT)
			{
//				Serial.println("Frame Stop!");
				flag_frameStartBT = 0;
				rLength = j2;
				j2 = 0;
				enableTranslate_Bluetooth = 1;
			}
		}
	}
//	flag_frameStart = 0;

	if(enableTranslate_Bluetooth)
	{
//		Serial.println("enableTranslate_Bluetooth");
		enableTranslate_Bluetooth = 0;

		char *pi0, *pf0;
		pi0 = strchr(sInstrBluetooth,'$');
		pf0 = strchr(sInstrBluetooth,';');

		if(pi0!=NULL)
		{
			uint8_t l0=0;
			l0 = pf0 - pi0;

			int i;
			for(i=1;i<=l0;i++)
			{
				sInstr[i-1] = pi0[i];
//				Serial.write(sInstr[i-1]);
			}
			memset(sInstrBluetooth,0,sizeof(sInstrBluetooth));
	//		Serial.println(sInstr);

			enableDecode = 1;
		}
		else
		{
//			Serial.println("Err");
//			Serial.write(pi0[0]);
//			Serial.write(pf0[0]);
		}
	}
}


#endif /* HARDWARE_H_ */




#endif /* ACIONNA_H_ */
